import random, time, getch
from os import system

class user:
    def __init__(self):
        self.cash = 1232
player = user()


class cazino:
    def main_menu():
        system('clear')
        print(f'Вы вошли в холл великого казика!\n- Вы смотрите на свои сбережения', end='')
        time.sleep(0.5)
        print('...', end='')

        print(f'\nВы обнаружили у себя {player.cash} рублев, где вы хотите "преумножить" свой капитал?\n')
        input()
        def main_gui(choice):
            system('clear')
            match choice:
                case 1:
                    print('=-------------------------=')
                    print('| *Слоты*  |   ЧерниДжек  |')
                    print('=-------------------------=')
                    print('|      Уйти с позором     |')
                    print('=-------------------------=\n')
                    print('wasd | e - выбор')
                case 2:
                    print('=-------------------------=')
                    print('|  Слоты   |  *ЧерниДжек* |')
                    print('=-------------------------=')
                    print('|      Уйти с позором     |')
                    print('=-------------------------=\n')
                    print('wasd | e - выбор')
                case 9:
                    print('=-------------------------=')
                    print('|   Слоты  |   ЧерниДжек  |')
                    print('=-------------------------=')
                    print('|     *Уйти с позором*    |')
                    print('=-------------------------=\n')
                    print('wasd | e - выбор')


        main_gui(1)
        choice = 1
        while True:
            if getch.getch() == 'd' and choice not in [2, 9]:
                choice += 1
            elif getch.getch() == 'a' and choice not in [1, 9]:
                choice -= 1
            elif getch.getch() == 'w':
                choice = 1
            elif getch.getch() == 's':
                choice = 9
            elif getch.getch() == 'e':
                break
            main_gui(choice)

        if choice == 1:
            dep = int(input('Сколько вы хотите депнуть? '))
            cazino.slots(dep)
        elif choice == 2:
            dep = int(input('Сколько вы хотите депнуть? '))
            cazino.black_jack(dep)
        elif choice not in [1, 2]:
            print('Вас выгнали...')
            exit()



    def slots(dep):
        symbol = ('♦', '♥', '♣', '♠', '')
        slot_1, slot_2, slot_3 = '', '', ''

        while True:
            if player.cash < dep:
                print('У вас недостаточно средств!')
                time.sleep(2)
                cazino.main_menu()
                break
            chose = input('Дернуть рычаг?(y/n) ')
            if chose == 'y':
                for _ in range(20):
                    system('clear')
                    slot_1, slot_2, slot_3 = random.choice(symbol), random.choice(symbol), random.choice(symbol)
                    print('      Слотики')
                    print('=-----------------=')
                    print('| ', slot_1, ' | ', slot_2, ' | ', slot_3, ' |')
                    print('=-----------------=')
                    time.sleep(0.3)
                    
            if chose != 'y': pass
            elif slot_1 == slot_2 and slot_2 == slot_3 and chose == 'y':
                dep *= 10
                player.cash += dep
                print('Поздравляю! Ваш баланс:', player.cash)
                chose = input('Вы выйграли. Хотите начать снова?(y/n)')
                if chose == 'y': pass
                else:
                    print('Пока!')
                    break
            else:
                player.cash -= dep
                if player.cash < dep:
                    print('▒▒▓▓▓▓▓▓████████████████████████████████████████████████████████████████████████▓█▓▓██████\n▓███████████████████████████████████████████████████████████████████████████████▓▓▓███████\n████▒░░░▒▒▓░░████▓░░█████░░██░░▓▒░░░▒▓█░░▒░░▓████▒░░░▒▒██░░░███░░▓█░░██░░▒▒░▒█▓░▓██░░█████\n█████▓░░██▓░░████▓░░█████░░█░░▓██▓░░██▒░▒██░░██████░░████░░░▓██░░▓▒░▓█▓░▒██░░█▓░▓█░░░█████\n█████▓░░██▓░░▒▒▓█▓░░█████░░░░▒███▓░░██▒░▓██░░██████░░███▒░▓░▒██░░░░▒██▓░▒██░░█▓░▓▒▒░░█████\n█████▓░░██▓░░█▓░▒▓░░█████░░▓░░███▓░░██▒░▓██░░██████░░███░░▓░░██░░▓░░██▓░▒██░░█▓░░░█░░█████\n█████▓░░██▓░░█▒░▒▓░░█████░░█▓░▒██▓░░██▓░▒█▓░▒█████▓░░██▓░▒▓▒░▒█░░▓▓░░█▓░░██░░█▓░░██░░█▓▓██\n█████▓▒▒██▓▒▒▒▒▓██▒▒█████▒▒██▓▒▓█▓▒▒███▓▒▒▒▒███▓▓▓▓▒▒██▓▒▓██▒▒█▒▒██▓▒▓█▓▒▒▒▒██▓▒███▒▒█▒░██\n█████████████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓███████████████████████████████▓▓██\n███████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓█████████████████████████████\n█████████████████████████▓▓▓▓▓▓▒▓▒▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▓█▓▒██▓▒▓█▒▒█▓▒▒███▒▒███████\n████████████████████████▓▒▓▓▓▒▒▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██░░▓█░░█▓░▒█▒░▓▓░░█░░███▓░░▒██████\n█████████████████████▓▓▓▓▒▒▒▒▒▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█░░██▓▓██░░█░░█▓░░▒░▓███░░▒░██████\n████████▓▓▓▓▓███▓▓▓▓▓▓▓▓▓▒▒▒▒▓▓▓▒▒▓▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█░░██████▓░▓░▓█▓░░░░███▓░▒▓░▒█████\n███▓▓▓▓▓▓▓▒▒▒█▓█▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█░░██░░▓██░░░██▓░░█░░██▒░▒▒░░█████\n▓▓▓▒▒▒▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒░░▒░░███▒░▒██▓░░█▓░▒█░░██▒░▓▒░██\n▒▒▒▒▒▒▒▒▒▒▒▒▓██▓▓▓▓▓▓▓▓███▓▒▒▒▓▓▒▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████▓███▓▒░░██████████████████▓░██\n▒▒▒▒▒▒▒▒▒▓▓█████▓▓▒▓▓▓▓█████▒▒▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓████████████████████████████████████████████\n▒▒▒▒▒▒▒▒▓█████████▓▓▓▓▒▓█████▓▒▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████▓██████████████▓▓▓███████████\n▒▒▒▒▒▒▒▓████████████▓▓▓▒▓████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓████████████░░██▓░▒▓▒░░░▒█▓░▒▒░░██░░░▒▒▓██\n▒▒▒▒▓▒▒▓█████████████▓█▓▒▒█▓▓▓▓▓▓▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓███████████░░██▓░▒██▒░▒██░░██▒░▒█░░▓█████\n▒▒▒▒▓▒▒▓█████████████████▓▓▓▓▓▓███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███████████▒░░▒░░▒██▒░▒██░░▓▓▒░▒█░░░░▒▒▓▓\n▓▓▓▓▓▓███████████████████▓▒░▒▓████▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▒▒▓▓▓▒░▒▓▓▒░▒██░░██▒░▒█░░▓█░░▓▓\n▓▓████████████████████████▓▓▓▓█████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▒▓▒▒▒▓▓▒░▒██▒░▒▓▓▒░▒▓░░▓█░░▓▓░░▓▓\n▒▓▓▓█████████████████████████▓▒████▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▒▒▓▓▒▒▓▓▓▓▒▒▒▒▓██▒▒▒▒▒▓▓▓\n▒▓▓▓▓████████████████████████▓▓▒█████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▓▓▓▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n▓▓▓▓▓▓██████████████████████▓▓▓▓█▓▒▓█▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▓▓▓▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓\n▒▓▓▓▒▓▓██████████████████████▓██▓▒▒▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▓▓▒▒▓▒▒▒▒▒▓▒▒▓▓▓▓▒░░░░▒▓░░░░░▒▓▒░░░▒▓▓▓\n▓▓▓▓▓▓▓█████████████████████████▓▓▓▓▓▓▓▓▓▓▒░▒▒▒▒▓▓▓▓▒▒▒▒░▒▓▓▓▓▒▓▓▒▓▓░░██░░▓▓▓░░█▓▒░▒█▓░░█▓\n▓▓▓▓▓▓▓▓████████████████▓▓██████▓▓▓▓▓▓▓▓▓▓▒▒▒▒░▒▓▓▒▒▒▒░░▒▒▒▒▓▓▓▒▒▒▓▒▒▓▓▓░░▓▓▓░░█▓▒░▒█▓░░█▓\n▒▓▓▓▓▓▓▓███▓████████████▓▓▓███████▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▒▒▒░░▓▒▒▒▒▒▓▒▓▒▓▒▓█▓▓░░▓█▓░░██▒░▒█▓░░██\n▓▓▓▓▓▓▓▓███▓███████████▓▓▓▓███████▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▒▒▒░░▒▒▒▒▒▒▒▒▓▓▓█░░██░░▓█▓░░██▒░▒█▓░░██\n▓▓▓▓▓▓▓▓▓██▓██████████▓▓▓▓▓███████▓▓▓▓▓▓▓▒▒▒▒▒░▒▒▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▓███▓░░░░▒██▓░░███░░░░░▓██\n▓▓▓▓▓▓▓▓▓█████████████▓▓▓▓█████████▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▒▒▒▒░▒▒▒▒▒▒▒▓▓▓███████████████████████\n▓▓▓▓▓▓▓▓▓████████████▓▓▓▓▓██████████▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒▓▓▓▓███████████▓▓▓█████▓▓▓▓\n▓▓▓▓▓▓▓▓▓████████████▓▓▓▓███████▓▓▓▓█▓▓▓▓▓▓▓▒▓▓▓▒▒▒▒▓▓▒▒▒▒▒░▒▒▓▓▓▓██▓▓▓▓▓▓█▓▓███████▓▓▓▓▓▓\n▓▓▓▓▓▓▓▓▓█████████████████████▓░░▓░░▓██▓░░▒░░█▓░░▒▒▒▓▓▒░░▒░░▓▓▒▒░░▓█▓▒░░▒▒▓▒░▓████▓░▒▒░░▓▓\n▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▓███████████▒░▓█▓░▒██▓░▒█░░██▒░▒█▓▓▓▒░▓█░░▓▓▓░░░▒███▒░▒██▒░▓████▓▓██░░██\n▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▓██▓▓▓██████▒░▓█▓▓▓▓█▓░▓█░░██▒░░▒▓▓▓▒░▓█░░▓█▓░▓▒░███▒░▒██▒░░▒░▒███▓░░▓██\n▓▓▓▓▓▓▓▓▓███▓▓██▓▓███▓▓▓██████▒░▓█▒░▒▓▓░░██░░██▒░▓████░░▓█░░▓█▒░▒▒░▒██▒░▒██▒░▓█▒░▓██░▒████\n███▓▓▓▓▓▓███▓▓▓▓▓█████████████▓░▒▓░░▓▓▒░▒▓▓░░▓█▒░▒▓▓▓▒░░██░░▓█░░██░░██▒░▒██▒░▒▓░░▓██▒▓████\n███▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓█████████▓▓▒▓▓█▒░▓▓▓▓▓▒░▓▓▓▓▓▓▓▓▓███▓▓█▓▓▓██▓▓██▓▓▓██▓▓▓▓▓████▓▓████\n███▓▓█▓▓███▓▓▓▓▓▓▓▓▓▓▓▓█▓████████████▓▒█████▓▒████████████████████████████████████████████\n██▓▓█▓▓▓██▓▓▓█▓▓▓▓▓▓▓▓▓▓▓▓████████████████████████████████████████████████████████████████\n')
                print(f'Ваш баланс теперь, {player.cash}')
                chose = input('Вы проиграли. Хотите начать снова?(y/n)')
                if chose == 'y': pass
                else:
                    print('Пока!')
                    break
            

    def black_jack(dep):
        cards = []
        card, count = 0, 1
        dealer, user = 0, 0

        for i in range(2, 14):
            for _ in range(4):
                cards.append(i)

        if player.cash < dep:
            print('У вас недостаточно средств!')
            time.sleep(3)
            cazino.main_menu()


        while True:
            if dealer >= 21 or user >= 21:
                system('clear')
                if dealer == 21:
                    print('Диллер победил!')
                    player.cash -= dep
                elif user == 21:
                    print('Вы победили!!!')
                    player.cash += dep * 2
                elif dealer > 21:
                    print('Диллер проиграл ')
                elif user > 21:
                    print('Диллер победил!')
                    player.cash -= dep
                if input('Хотите повторить?(y/n)') == 'y':
                    dep = input('Внезапный деп!? ')
                    break
                else:
                    cazino.main_menu()
            elif count == 'xuy':
                system('clear')
                if user > dealer and user <= 21:
                    print('Пабеда!!!')
                elif dealer > user and dealer <= 21:
                    print('Вас обыграли!')
                if input('Хотите повторить?(y/n)') == 'y':
                    dep = input('Внезапный деп!? ')
                    break
                else:
                    cazino.main_menu()

            if count % 2 == 0:
                system('clear')
                count += 1
                print(f'Ход диллера!          Ваш счет - {user}    Счет диллера - {dealer}')
                time.sleep(1)
                if dealer >= 15 and random.randint(1, 10) % 2 == 0:
                    count = 'xuy'
                    continue
                card = random.choice(cards)
                dealer += card
                cards.remove(card)
                print(f'Диллер взял карту, его счет - {dealer}')
            elif count % 2 != 0:
                system('clear')
                count += 1
                chose = input(f'Ваш ход!          Ваш счет - {user}    Счет диллера - {dealer}\nВзять или нет?(give/pass)')
                time.sleep(1)
                if chose == 'give':
                    card = random.choice(cards)
                    user += card
                    cards.remove(card)
                elif chose == 'pass':
                    print('Вы решили не брать карту')
                    count = 'xuy'
        cazino.black_jack(dep)

cazino.main_menu()