from os import system
import random
import time

# что относится к слотам
symbol = ('♦', '♥', '♣', '♠', '')
chose = 0 # выбор игрока
balance = int() # кошелек игрока
symbol_1 = 1 # слот №1
symbol_2 = 2 # слот №2
symbol_3 = 3 # слот №3

# что относится к мини-игре математика
a_math = random.randint(0, 256) # число 1
b_math = random.randint(0, 256) # число 2
c_math = 0 # ответ от 1 и 2 чисел
znak_list = ['//', '*', '+', '-'] # список знаков
znak = 0 # выпавший знак знак
otvet = 0 # ответ игрока

# что относится к мини-игре слова
word_list = ['привет', 'пока'] # список слов для игры, пока хз как импортировать их какого нибудь словаря
score = 0 # счет игрока 
current_word = 0 # раномное слово из списка
enter_word = 0 # введенное слово


class game:
    
    def __init__(self):
        self.main_menu()

    def main_menu(self): # меню
        global balance 

        system('clear')
        otvet = input(f'Любимые слоты!\n\n\nВаш баланс равен {balance}!\nОдна игра стоит 100. Хотите начать игру или пополнить баланс? (game/bal/exit)')
        if otvet == 'game':
            system('clear')
            self.cazik()
        elif otvet =='exit':
            pass
        else:
            system('clear')
            self.balance_chose()

    def balance_chose(self): # выбор пополнения баланса
        global balance 

        print(f'На данный момент ваш баланс осотавляет: {balance}\nСпособоы пополнения баланса:\n1. Примеры - 200\n2. Слова - 100')
        chose = input('Введите номер выбора: ')
        if chose == '1':
            self.balance_plus_math()
        elif chose == '2':
            self.balance_plus_gram()

    def balance_plus_math(self): # пополнение математикой
        a_math = random.randint(0, 256)
        b_math = random.randint(0, 256)
        znak_list = ['//', '*', '+', '-']
        znak = random.choice(znak_list)
        otvet = int(input(f'{a_math} {znak} {b_math} = ?'))
        global balance 
        
        match(znak):
            case '//':
                c_math = a_math // b_math
                print(c_math)
                if otvet == c_math:
                    balance = balance + 200
                    print(f'Поздравляю ваш баланс теперь составляет: {balance}\nПробуем еще раз?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
                else:
                    print('К сожалению ответ не верен(\nПробуем еще?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
            case '*':
                c_math = a_math * b_math
                print(c_math)
                if otvet == c_math:
                    balance = balance + 200
                    print(f'Поздравляю ваш баланс теперь составляет: {balance}\nПробуем еще раз?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
                else:
                    print('К сожалению ответ не верен(\nПробуем еще?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
            case '+':
                c_math = a_math + b_math
                print(c_math)
                if otvet == c_math:
                    balance = balance + 200
                    print(f'Поздравляю ваш баланс теперь составляет: {balance}\nПробуем еще раз?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
                else:
                    print('К сожалению ответ не верен(\nПробуем еще?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
            case '-':
                c_math = a_math - b_math
                print(c_math)
                if otvet == c_math:
                    balance = balance + 200
                    print(f'Поздравляю ваш баланс теперь составляет: {balance}\nПробуем еще раз?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()
                else:
                    print('К сожалению ответ не верен(\nПробуем еще?(y/n)')
                    chose = input('(y/n)')
                    if chose == 'y':
                        self.balance_plus_math()
                    else:
                        self.main_menu()

    def balance_plus_gram(self): # пополнение словами
        word_list = ['привет', 'пока'] # список слов для игры, пока хз как импортировать их какого нибудь словаря
        score = 0 # счет игрока 
        current_word = random.choice(word_list) # раномное слово из списка
        enter_word = 0 # введенное слово
        global balance 

        input('Для получения награды вы должны правильно ввести 5 слов, готовы? (y/n)')

        for i in range(0, 5): # уровень 1
            system('clear')
            current_word = random.choice(word_list)
            print(f'Текущее слово: {current_word}')
            enter_word = input('Ввод слова: ')
            
            if enter_word == current_word:
                pass
                score += 1 
            elif enter_word != current_word:
                system('clear')
                break
        if score == 5:
            balance += 100
            print(f'Поздравляю ваш баланс теперь составляет: {balance}\nПробуем еще раз?(y/n)')
            chose = input('(y/n)')
            if chose == 'y':
                self.balance_plus_gram()
            else:
                self.main_menu()
        else:
            print('К сожалению вы ошиблись(\nПробуем еще?(y/n)')
            chose = input('(y/n)')
            if chose == 'y':
                self.balance_plus_gram()
            else:
                self.main_menu()

    def cazik(self): # слоты
        global balance 
        while True:
            if balance >= 100:
                print(f'Ваш баланс: {balance}')
                chose = input('Крутим слоты?(y/n)')
                for i in range(0, 20):
                    system('clear')
                    if chose == 'y':
                        symbol_1, symbol_2, symbol_3 = random.choice(symbol), random.choice(symbol), random.choice(symbol)
                        print('      Слотики')
                        print('=-----------------=')
                        print('| ', symbol_1, ' | ', symbol_2, ' | ', symbol_3, ' |')
                        print('=-----------------=')
                        time.sleep(0.3)
                    else:
                        print('Пока')
                        break
                if chose != 'y':
                    pass
                elif symbol_1 == symbol_2 and symbol_2 == symbol_3 and chose == 'y':
                    balance *= 10
                    print('Поздравляю! Ваш баланс:', balance)
                    chose = input('Вы выйграли. Хотите начать снова?(y/n)')
                    if chose == 'y':
                        pass
                    else:
                        print('Пока!')
                        break
                elif symbol_1 != symbol_2 and balance <= 100:
                    print('▒▒▓▓▓▓▓▓████████████████████████████████████████████████████████████████████████▓█▓▓██████\n▓███████████████████████████████████████████████████████████████████████████████▓▓▓███████\n████▒░░░▒▒▓░░████▓░░█████░░██░░▓▒░░░▒▓█░░▒░░▓████▒░░░▒▒██░░░███░░▓█░░██░░▒▒░▒█▓░▓██░░█████\n█████▓░░██▓░░████▓░░█████░░█░░▓██▓░░██▒░▒██░░██████░░████░░░▓██░░▓▒░▓█▓░▒██░░█▓░▓█░░░█████\n█████▓░░██▓░░▒▒▓█▓░░█████░░░░▒███▓░░██▒░▓██░░██████░░███▒░▓░▒██░░░░▒██▓░▒██░░█▓░▓▒▒░░█████\n█████▓░░██▓░░█▓░▒▓░░█████░░▓░░███▓░░██▒░▓██░░██████░░███░░▓░░██░░▓░░██▓░▒██░░█▓░░░█░░█████\n█████▓░░██▓░░█▒░▒▓░░█████░░█▓░▒██▓░░██▓░▒█▓░▒█████▓░░██▓░▒▓▒░▒█░░▓▓░░█▓░░██░░█▓░░██░░█▓▓██\n█████▓▒▒██▓▒▒▒▒▓██▒▒█████▒▒██▓▒▓█▓▒▒███▓▒▒▒▒███▓▓▓▓▒▒██▓▒▓██▒▒█▒▒██▓▒▓█▓▒▒▒▒██▓▒███▒▒█▒░██\n█████████████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓███████████████████████████████▓▓██\n███████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓█████████████████████████████\n█████████████████████████▓▓▓▓▓▓▒▓▒▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▓█▓▒██▓▒▓█▒▒█▓▒▒███▒▒███████\n████████████████████████▓▒▓▓▓▒▒▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██░░▓█░░█▓░▒█▒░▓▓░░█░░███▓░░▒██████\n█████████████████████▓▓▓▓▒▒▒▒▒▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█░░██▓▓██░░█░░█▓░░▒░▓███░░▒░██████\n████████▓▓▓▓▓███▓▓▓▓▓▓▓▓▓▒▒▒▒▓▓▓▒▒▓▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█░░██████▓░▓░▓█▓░░░░███▓░▒▓░▒█████\n███▓▓▓▓▓▓▓▒▒▒█▓█▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█░░██░░▓██░░░██▓░░█░░██▒░▒▒░░█████\n▓▓▓▒▒▒▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒░░▒░░███▒░▒██▓░░█▓░▒█░░██▒░▓▒░██\n▒▒▒▒▒▒▒▒▒▒▒▒▓██▓▓▓▓▓▓▓▓███▓▒▒▒▓▓▒▓▓▓▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████▓███▓▒░░██████████████████▓░██\n▒▒▒▒▒▒▒▒▒▓▓█████▓▓▒▓▓▓▓█████▒▒▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓████████████████████████████████████████████\n▒▒▒▒▒▒▒▒▓█████████▓▓▓▓▒▓█████▓▒▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████▓██████████████▓▓▓███████████\n▒▒▒▒▒▒▒▓████████████▓▓▓▒▓████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓████████████░░██▓░▒▓▒░░░▒█▓░▒▒░░██░░░▒▒▓██\n▒▒▒▒▓▒▒▓█████████████▓█▓▒▒█▓▓▓▓▓▓▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓███████████░░██▓░▒██▒░▒██░░██▒░▒█░░▓█████\n▒▒▒▒▓▒▒▓█████████████████▓▓▓▓▓▓███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███████████▒░░▒░░▒██▒░▒██░░▓▓▒░▒█░░░░▒▒▓▓\n▓▓▓▓▓▓███████████████████▓▒░▒▓████▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▒▒▓▓▓▒░▒▓▓▒░▒██░░██▒░▒█░░▓█░░▓▓\n▓▓████████████████████████▓▓▓▓█████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▓▓▓▒▓▒▒▒▓▓▒░▒██▒░▒▓▓▒░▒▓░░▓█░░▓▓░░▓▓\n▒▓▓▓█████████████████████████▓▒████▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▒▒▓▓▒▒▓▓▓▓▒▒▒▒▓██▒▒▒▒▒▓▓▓\n\▒▓▓▓▓████████████████████████▓▓▒█████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▓▓▓▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n▓▓▓▓▓▓██████████████████████▓▓▓▓█▓▒▓█▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▓▓▓▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓\n▒▓▓▓▒▓▓██████████████████████▓██▓▒▒▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▓▓▓▒▒▓▒▒▒▒▒▓▒▒▓▓▓▓▒░░░░▒▓░░░░░▒▓▒░░░▒▓▓▓\n▓▓▓▓▓▓▓█████████████████████████▓▓▓▓▓▓▓▓▓▓▒░▒▒▒▒▓▓▓▓▒▒▒▒░▒▓▓▓▓▒▓▓▒▓▓░░██░░▓▓▓░░█▓▒░▒█▓░░█▓\n▓▓▓▓▓▓▓▓████████████████▓▓██████▓▓▓▓▓▓▓▓▓▓▒▒▒▒░▒▓▓▒▒▒▒░░▒▒▒▒▓▓▓▒▒▒▓▒▒▓▓▓░░▓▓▓░░█▓▒░▒█▓░░█▓\n▒▓▓▓▓▓▓▓███▓████████████▓▓▓███████▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▒▒▒░░▓▒▒▒▒▒▓▒▓▒▓▒▓█▓▓░░▓█▓░░██▒░▒█▓░░██\n▓▓▓▓▓▓▓▓███▓███████████▓▓▓▓███████▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▒▒▒░░▒▒▒▒▒▒▒▒▓▓▓█░░██░░▓█▓░░██▒░▒█▓░░██\n▓▓▓▓▓▓▓▓▓██▓██████████▓▓▓▓▓███████▓▓▓▓▓▓▓▒▒▒▒▒░▒▒▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▓███▓░░░░▒██▓░░███░░░░░▓██\n▓▓▓▓▓▓▓▓▓█████████████▓▓▓▓█████████▓▓▓▓▓▓▓▒▒▒▒▒▒▓▒▒▒▒▒▒▒░▒▒▒▒▒▒▒▓▓▓███████████████████████\n▓▓▓▓▓▓▓▓▓████████████▓▓▓▓▓██████████▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒▓▓▓▓███████████▓▓▓█████▓▓▓▓\n▓▓▓▓▓▓▓▓▓████████████▓▓▓▓███████▓▓▓▓█▓▓▓▓▓▓▓▒▓▓▓▒▒▒▒▓▓▒▒▒▒▒░▒▒▓▓▓▓██▓▓▓▓▓▓█▓▓███████▓▓▓▓▓▓\n▓▓▓▓▓▓▓▓▓█████████████████████▓░░▓░░▓██▓░░▒░░█▓░░▒▒▒▓▓▒░░▒░░▓▓▒▒░░▓█▓▒░░▒▒▓▒░▓████▓░▒▒░░▓▓\n▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▓███████████▒░▓█▓░▒██▓░▒█░░██▒░▒█▓▓▓▒░▓█░░▓▓▓░░░▒███▒░▒██▒░▓████▓▓██░░██\n▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▓██▓▓▓██████▒░▓█▓▓▓▓█▓░▓█░░██▒░░▒▓▓▓▒░▓█░░▓█▓░▓▒░███▒░▒██▒░░▒░▒███▓░░▓██\n▓▓▓▓▓▓▓▓▓███▓▓██▓▓███▓▓▓██████▒░▓█▒░▒▓▓░░██░░██▒░▓████░░▓█░░▓█▒░▒▒░▒██▒░▒██▒░▓█▒░▓██░▒████\n███▓▓▓▓▓▓███▓▓▓▓▓█████████████▓░▒▓░░▓▓▒░▒▓▓░░▓█▒░▒▓▓▓▒░░██░░▓█░░██░░██▒░▒██▒░▒▓░░▓██▒▓████\n███▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓█████████▓▓▒▓▓█▒░▓▓▓▓▓▒░▓▓▓▓▓▓▓▓▓███▓▓█▓▓▓██▓▓██▓▓▓██▓▓▓▓▓████▓▓████\n███▓▓█▓▓███▓▓▓▓▓▓▓▓▓▓▓▓█▓████████████▓▒█████▓▒████████████████████████████████████████████\n██▓▓█▓▓▓██▓▓▓█▓▓▓▓▓▓▓▓▓▓▓▓████████████████████████████████████████████████████████████████\n')
                    balance -= 100
                    print(f'Ваш баланс теперь, {balance}')
                    chose = input('Вы проиграли. Хотите начать снова?(y/n)')
                    if chose == 'y':
                        pass
                    else:
                        print('Пока!')
                        break
                else:
                    balance -= 100
                    print(f'Ваш баланс теперь, {balance}')
                    chose = input('Вы проиграли. Хотите начать снова?(y/n)')
                    if chose == 'y':
                        pass
                    else:
                        print('Пока!')
                        break
            else:
                print('У вас недостаточно средств!')
                time.sleep(5)
                self.main_menu()
                break
  
slot_game = game()
slot_game.main_menu()